{
  "aboutMe": {
    "paragraphs": [
      "I'm a full-stack web developer specializing in building modern, scalable, and user-focused applications. I work with HTML, CSS, JavaScript, and PHP, and use frameworks like Laravel, React, Next.js, and Inertia.js to create fast, maintainable, and production-ready systems.",
      "On the backend, I design structured APIs and data-driven applications using Laravel, MySQL, PostgreSQL, and Supabase. On the frontend, I craft clean and responsive interfaces with TypeScript, Tailwind CSS, and modern React-based workflows.",
      "I also develop mobile applications using React Native and Ionic, and handle deployments using tools like DigitalOcean, Vercel, PM2, and Git, ensuring reliable hosting, version control, and smooth production releases.",
      "Overall, I focus on turning ideas into functional products—balancing performance, clean code, and real-world usability."
    ]
  },
  "whatImDoing": {
    "title": "What I'm Doing",
    "services": [
      {
        "icon": "Globe",
        "title": "Web Development",
        "description": "I build responsive, performant websites using modern tools and best practices, focusing on clean code, scalability, and real-world usability."
      },
      {
        "icon": "Layout",
        "title": "Frontend Engineering",
        "description": "I create intuitive user interfaces with HTML, CSS, and JavaScript, paying close attention to layout, accessibility, and smooth user experience."
      },
      {
        "icon": "Server",
        "title": "Backend & APIs",
        "description": "I develop reliable backend systems using PHP and Laravel, designing RESTful APIs, handling data securely, and structuring applications for long-term growth."
      },
      {
        "icon": "Rocket",
        "title": "Product-Focused Projects",
        "description": "I turn ideas into functional products—prototypes, internal tools, or community-driven apps—always prioritizing clarity, impact, and maintainability."
      }
    ]
  }
}
